Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 8, 8, 6)]         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 8, 8, 32)          224       
_________________________________________________________________
activation_7 (Activation)    (None, 8, 8, 32)          0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 8, 8, 32)          128       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 8, 8, 32)          9248      
_________________________________________________________________
activation_8 (Activation)    (None, 8, 8, 32)          0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 8, 8, 32)          128       
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 8, 8, 32)          9248      
_________________________________________________________________
activation_9 (Activation)    (None, 8, 8, 32)          0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 8, 8, 32)          128       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 8, 8, 32)          9248      
_________________________________________________________________
activation_10 (Activation)   (None, 8, 8, 32)          0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 8, 8, 32)          128       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 8, 8, 32)          9248      
_________________________________________________________________
activation_11 (Activation)   (None, 8, 8, 32)          0         
_________________________________________________________________
batch_normalization_11 (Batc (None, 8, 8, 32)          128       
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 8, 8, 32)          9248      
_________________________________________________________________
activation_12 (Activation)   (None, 8, 8, 32)          0         
_________________________________________________________________
batch_normalization_12 (Batc (None, 8, 8, 32)          128       
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 8, 8, 32)          9248      
_________________________________________________________________
activation_13 (Activation)   (None, 8, 8, 32)          0         
_________________________________________________________________
batch_normalization_13 (Batc (None, 8, 8, 32)          128       
_________________________________________________________________
flatten_1 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 128)               262272    
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 128)               16512     
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 5)                 645       
=================================================================
Total params: 336,037
Trainable params: 335,589
Non-trainable params: 448
_________________________________________________________________
